Revit 2024 API
Alignment.Name Property
 The Name of this alignment.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public string Name { get; }
Visual Basic
Public ReadOnly Property Name As String
	Get
Visual C++
public:
property String^ Name {
	String^ get ();
}
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace